import java.util.Arrays;

public class P51DistubeCandies {
    public static void main(String[] args) {
        int[] a = new int[]{10, 2, 8, 22, 16, 4, 10, 6, 14, 20};
        for (; ; ) {

            for (int i = 0; i < a.length; i++) if (a[i] % 2 == 1) ++a[i];
            System.out.println(Arrays.toString(a));
            int[] b = a.clone();
            for (int i = 0; i < a.length; i++) {
                int j = (i + 1) % a.length;
                a[i] -= b[i] / 2;
                a[j] += b[i] / 2;
            }
            int[] c = a.clone();
            Arrays.sort(c);
            if (c[0] == c[c.length - 1]) break;

        }
    }


}
//51 10个小孩分糖果
//        十个小孩围成一圈分糖果，老师分给第一个小孩10块，第二个小孩2块，第三个小孩8块，第四个小孩22块，第五个小孩16块，第六个小孩4块，第七个小孩10块，第八个小孩6块，第九个小孩14块，第十个小孩20块。然后所有的小孩同时将手中的糖分一半给右边的小孩；糖块数为奇数的人可向老师要一块。问经过这样几次后大家手中的糖的块数一样多？每人各有多少块糖？
//
//        *运行结果
//        child
//        r   1   2   3   4   5   6   7   8  9   10
//        0   10   2   8  22  16   4  10   6  14  20
//        1   15   6   5  15  19  10   7   8  10  17
//        2   17  11   6  11  18  15   9   8   9  14
//        3   16  15   9   9  15  17  13   9   9  12
//        4   14  16  13  10  13  17  16  12  10  11
//        5   13  15  15  12  12  16  17  14  11  11
//        6   13  15  16  14  12  14  17  16  13  12
//        7   13  15  16  15  13  13  16  17  15  13
//        8   14  15  16  16  15  14  15  17  17  15
//        9   15  15  16  16  16  15  15  17  18  17
//        10   17  16  16  16  16  16  16  17  18  18
//        11   18  17  16  16  16  16  16  17  18  18
//        12   18  18  17  16  16  16  16  17  18  18
//        13   18  18  18  17  16  16  16  17  18  18
//        14   18  18  18  18  17  16  16  17  18  18
//        15   18  18  18  18  18  17  16  17  18  18
//        16   18  18  18  18  18  18  17  17  18  18
//        17   18  18  18  18  18  18  18  18  18  18
